<%@ page contentType="text/html; charset=UTF-8"%>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Title</title>
    <link rel="shortcut icon" href="./source/icon.png" />
    <link rel="stylesheet" href="./lib/bootstrap/css/bootstrap.min.css" />
    <link rel="stylesheet" href="./lib/swiper/swiper-3.4.2.min.css" />
    <link rel="stylesheet" href="./css/wx_home.css" />
    <link rel="stylesheet" href="./css/wx_foot.css" />
</head>
<body>
    <div id="app">
        <header>
            <div class="opacity"></div>
            <div class="container">
                <div class="row">
                    <div class="col-lg-12 col-md-12 col-sm-12 col-xs-12">
                        <nav class="navbar navbar-default navbar-fixed-top navbar-inverse" role="navigation">
                            <div class="container">
                                <div class="navbar-header">
                                    <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                                        <span class="sr-only">Toggle navigation</span>
                                        <span class="icon-bar"></span>
                                        <span class="icon-bar"></span>
                                        <span class="icon-bar"></span>
                                    </button>
                                    <div class="logo">
                                        <svg xmlns="http://www.w3.org/2000/svg" width="138" height="36" viewBox="0 0 138 36">
                                            <path fill="#FFF" fill-rule="evenodd" d="M167.8,47.952 L177.112,47.952 L177.112,64.752 L151,64.752 L151,31.152 L167.8,31.152 L167.8,47.952 Z M196.792,30 C206.68,30 214.696,38.016 214.696,47.904 C214.696,57.792 206.68,65.808 196.792,65.808 C186.904,65.808 178.888,57.792 178.888,47.904 C178.888,38.016 186.904,30 196.792,30 Z M233.8,47.904 L251.56,47.904 C251.56,57.744 243.64,65.664 233.8,65.664 C223.96,65.664 216.04,57.744 216.04,47.904 C216.04,39.072 222.472,31.728 230.968,30.336 C234.952,29.712 239.128,30.48 242.68,32.496 L233.8,47.904 Z M270.568,30 C280.456,30 288.472,38.016 288.472,47.904 C288.472,57.792 280.456,65.808 270.568,65.808 C260.68,65.808 252.664,57.792 252.664,47.904 C252.664,38.016 260.68,30 270.568,30 Z" transform="translate(-151 -30)"/>
                                        </svg>
                                    </div>
                                    <div class="address">
                                        <span>
                                            <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14">
                                                <path fill-rule="evenodd" d="M176.074,221.516 C176.335335,221.516 176.577999,221.450667 176.802,221.32 C177.026001,221.189333 177.203333,221.014334 177.334,220.795 C177.464667,220.575666 177.53,220.335335 177.53,220.074 C177.53,219.812665 177.464667,219.570001 177.334,219.346 C177.203333,219.121999 177.026001,218.944667 176.802,218.814 C176.577999,218.683333 176.335335,218.618 176.074,218.618 C175.812665,218.618 175.572334,218.683333 175.353,218.814 C175.133666,218.944667 174.958667,219.121999 174.828,219.346 C174.697333,219.570001 174.632,219.812665 174.632,220.074 C174.632,220.475335 174.771999,220.815999 175.052,221.096 C175.332001,221.376001 175.672665,221.516 176.074,221.516 Z M176.074,216 C176.82067,216 177.506664,216.181998 178.132,216.546 C178.748003,216.910002 179.237998,217.399997 179.602,218.016 C179.966002,218.641336 180.148,219.32733 180.148,220.074 C180.148,220.643336 180.008001,221.296663 179.728,222.034 C179.485332,222.659336 179.149335,223.335996 178.72,224.064 C178.365332,224.64267 177.959336,225.244664 177.502,225.87 C177.184665,226.308669 176.848668,226.737998 176.494,227.158 L176.074,227.648 L175.654,227.158 C175.299332,226.737998 174.963335,226.308669 174.646,225.87 C174.188664,225.244664 173.782668,224.64267 173.428,224.064 C172.998665,223.335996 172.662668,222.659336 172.42,222.034 C172.139999,221.296663 172,220.643336 172,220.074 C172,219.32733 172.181998,218.641336 172.546,218.016 C172.910002,217.399997 173.399997,216.910002 174.016,216.546 C174.641336,216.181998 175.32733,216 176.074,216 Z" transform="translate(-169 -215)"/>
                                            </svg>
                                        </span>
                                        <span>成都</span>
                                    </div>
                                </div>
                                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                                    <ul class="nav navbar-nav">
                                        <li><a href="#">二手房</a></li>
                                        <li><a href="#">租房</a></li>
                                        <li><a href="#">经纪人</a></li>
                                    </ul>
                                </div>
                            </div>
                        </nav>
                    </div>
                </div>

                <div class="row box">
                    <div class="inputBox col-xs-12">
                        <input type="text" placeholder="请输入区域、商圈或小区名">
                        <div class="searchBtn" @click="searchBtnClick">搜索</div>
                    </div>
                </div>
            </div>
        </header>

        <%--<section class="layer-mobile">--%>
            <%--<div class="lay-head">--%>
                <%--<i class="back-icon"></i>--%>
                <%--<span>选择城市</span>--%>
            <%--</div>--%>
            <%--<div class="lay-main">--%>
                <%--<input type="text" placeholder="请输入城市名进行搜素">--%>
                <%--<p>选择城市</p>--%>
                <%--<div class="geo">--%>
                    <%--<i class="icon-geo"></i>--%>
                    <%--<span>定位失败</span>--%>
                    <%--<span class="refren-icon"></span>--%>
                <%--</div>--%>
                <%--<p>最近访问</p>--%>
                <%--<div class="latest">--%>
                    <%--<a href="#"><span>成都</span></a>--%>
                <%--</div>--%>
                <%--<p>热门城市</p>--%>
                <%--<div class="hot-city">--%>
                    <%--<a href="#"><span>北京</span></a>--%>
                    <%--<a href="#"><span>上海</span></a>--%>
                    <%--<a href="#"><span>深圳</span></a>--%>
                <%--</div>--%>
                <%--<p>全部城市（按首字母顺序）</p>--%>
                <%--<div class="cs">--%>
                    <%--<a href="#"><span>A</span></a>--%>
                    <%--<a href="#"><span>B</span></a>--%>
                    <%--<a href="#"><span>C</span></a>--%>
                    <%--<a href="#"><span>D</span></a>--%>
                    <%--<a href="#"><span>E</span></a>--%>
                    <%--<a href="#"><span>F</span></a>--%>
                    <%--<a href="#"><span>G</span></a>--%>
                    <%--<a href="#"><span>H</span></a>--%>
                    <%--<a href="#"><span>J</span></a>--%>
                    <%--<a href="#"><span>I</span></a>--%>
                    <%--<a href="#"><span>E</span></a>--%>
                    <%--<a href="#"><span>F</span></a>--%>
                    <%--<a href="#"><span>G</span></a>--%>
                    <%--<a href="#"><span>H</span></a>--%>
                    <%--<a href="#"><span>J</span></a>--%>
                <%--</div>--%>
                <%--<div class="city-group">--%>
                    <%--<p id="A">A</p>--%>
                    <%--<div class="city-block">--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                    <%--</div>--%>
                <%--</div>--%>
                <%--<div class="city-group">--%>
                    <%--<p ID="B">B</p>--%>
                    <%--<div class="city-block">--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                    <%--</div>--%>
                <%--</div>--%>
                <%--<div class="city-group">--%>
                    <%--<p id="C">C</p>--%>
                    <%--<div class="city-block">--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                    <%--</div>--%>
                <%--</div>--%>
                <%--<div class="city-group">--%>
                    <%--<p id="D">D</p>--%>
                    <%--<div class="city-block">--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                    <%--</div>--%>
                <%--</div>--%>
                <%--<div class="city-group">--%>
                    <%--<p id="E">E</p>--%>
                    <%--<div class="city-block">--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                        <%--<a href="#"><span>成都</span></a>--%>
                    <%--</div>--%>
                <%--</div>--%>

            <%--</div>--%>
        <%--</section>--%>

        <section>
            <div class="container">
                <div class="row part4">
                    <div class="col-xs-4">
                        <div class="img" @click="sellPageTo">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32">
                                <g fill="#009688" transform="translate(6 6)">
                                    <path d="M7.50343125,11.2436207 L8.75794227,11.2436207 L8.75794227,12.4977413 L7.50343125,12.4977413 L7.50343125,11.2436207 Z M7.50343125,7.47735209 L8.75794227,7.47735209 L8.75794227,8.73147266 L7.50343125,8.73147266 L7.50343125,7.47735209 Z M3.73599004,7.47735209 L4.99050106,7.47735209 L4.99050106,8.73147266 L3.73599004,8.73147266 L3.73599004,7.47735209 Z M3.73599004,3.71108344 L4.99050106,3.71108344 L4.99050106,4.96520401 L3.73599004,4.96520401 L3.73599004,3.71108344 Z M3.73599004,11.2436207 L4.99050106,11.2436207 L4.99050106,12.4977413 L3.73599004,12.4977413 L3.73599004,11.2436207 Z M15.0344055,11.2436207 L16.2889166,11.2436207 L16.2889166,12.4977413 L15.0344055,12.4977413 L15.0344055,11.2436207 Z M7.50343125,3.71108344 L8.75794227,3.71108344 L8.75794227,4.96520401 L7.50343125,4.96520401 L7.50343125,3.71108344 Z M15.0344055,7.47735209 L16.2889166,7.47735209 L16.2889166,8.73147266 L15.0344055,8.73147266 L15.0344055,7.47735209 Z M15.0344055,15.0098894 L16.2889166,15.0098894 L16.2889166,16.26401 L15.0344055,16.26401 L15.0344055,15.0098894 Z"/>
                                    <path d="M18.7885893,3.76709652 L12.465807,3.76709652 L12.465807,1.21141071 C12.465807,0.54318093 11.922626,0 11.2543962,0 L1.21141071,0 C0.88706526,0 0.586166471,0.125048847 0.355607659,0.355607659 C0.128956624,0.582258695 0,0.88706526 0,1.21141071 L0,18.7885893 C0,19.4568191 0.54318093,20 1.21141071,20 L18.7885893,20 C19.1129347,20 19.4138335,19.8749512 19.6443923,19.6443923 C19.8749512,19.4138335 20,19.1129347 20,18.7885893 L20,4.97850723 C20,4.31027745 19.4568191,3.76709652 18.7885893,3.76709652 Z M7.28409535,18.8003126 C7.28409535,18.9409926 7.17858538,19.0543181 7.05353654,19.0543181 L5.37319265,19.0543181 C5.24423603,19.0543181 5.14263384,18.9409926 5.14263384,18.8003126 L5.14263384,16.2016413 C5.14263384,16.0609613 5.24423603,15.9476358 5.37319265,15.9476358 L7.05353654,15.9476358 C7.18249316,15.9476358 7.28409535,16.0609613 7.28409535,16.2016413 L7.28409535,18.8003126 Z M11.4224306,19.0425948 L8.11254396,19.0425948 L8.11254396,15.7835092 C8.11254396,15.6232903 8.05001954,15.4747948 7.93669402,15.3614693 C7.8233685,15.2481438 7.674873,15.1856194 7.51465416,15.1856194 L4.94333724,15.1856194 C4.78311841,15.1856194 4.6346229,15.2481438 4.52129738,15.3614693 C4.40797186,15.4747948 4.34544744,15.6232903 4.34544744,15.7835092 L4.34544744,19.0425948 L1.7272372,19.0425948 C1.54357171,19.0425948 1.36772177,18.9722548 1.23876514,18.8393904 C1.10980852,18.7104338 1.03556077,18.5345838 1.03556077,18.3509183 L1.03556077,1.6451739 C1.03556077,1.4615084 1.10590074,1.28565846 1.23876514,1.15670184 C1.36772177,1.02774521 1.54357171,0.95349746 1.7272372,0.95349746 L10.7229386,0.95349746 C10.9066041,0.95349746 11.0824541,1.02383744 11.2114107,1.15670184 C11.3403673,1.28565846 11.4146151,1.4615084 11.4146151,1.6451739 L11.4146151,19.0425948 L11.4224306,19.0425948 Z M18.9839781,18.2883939 C18.9839781,18.4720594 18.9136381,18.6440016 18.7807737,18.776866 C18.6518171,18.9058226 18.479875,18.9800703 18.2962095,18.9800703 L12.4853458,18.9800703 L12.4853458,4.79484174 L18.2962095,4.79484174 C18.479875,4.79484174 18.6518171,4.86518171 18.7846815,4.99804611 C18.9136381,5.12700274 18.9878859,5.2989449 18.9878859,5.48651817 L18.9878859,18.2883939 L18.9839781,18.2883939 Z"/>
                                </g>
                            </svg>
                        </div>
                        <p>二手房</p>
                    </div>
                    <div class="col-xs-4">
                        <div class="img" @click="rentPageTo">
                            <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32">
                                <g fill="#009688" transform="translate(5 6)">
                                    <path d="M16.6295844,9.93878909 C15.8131012,9.93975849 15.0629563,10.3974636 14.6760829,11.1307289 C14.2892094,11.8639942 14.3279792,12.7546026 14.7770458,13.4500206 L14.0395843,14.2021037 L13.0977662,13.241612 L12.4713682,13.8804296 L13.4131864,14.8409213 L13.0977662,15.1625955 L11.8405277,13.8804296 L11.2141298,14.5192472 L12.4713682,15.8014131 L12.155948,16.1230872 L12.7823459,16.7619048 L15.4034437,14.0888382 C16.1955949,14.6275075 17.2362719,14.5914212 17.990716,13.9991227 C18.7451602,13.4068242 19.0455674,12.3900529 18.7375714,11.4712834 C18.4295755,10.5525138 17.5816811,9.9360996 16.6295844,9.93878909 Z M16.6295844,13.5632861 C15.8935205,13.5632861 15.2968228,12.9547577 15.2968228,12.2040997 C15.2968228,11.4534418 15.8935205,10.8449134 16.6295844,10.8449134 C17.3656483,10.8449134 17.962346,11.4534418 17.962346,12.2040997 C17.962346,12.9547577 17.3656483,13.5632861 16.6295844,13.5632861 Z M6.85599937,3.14285714 L5.52323778,3.14285714 C4.78717388,3.14285714 4.19047619,3.75138562 4.19047619,4.50204353 L4.19047619,7.22041631 C4.19047619,7.97107423 4.78717388,8.5796027 5.52323778,8.5796027 L6.85599937,8.5796027 C7.59206327,8.5796027 8.18876096,7.97107423 8.18876096,7.22041631 L8.18876096,4.50204353 C8.18876096,3.75138562 7.59206327,3.14285714 6.85599937,3.14285714 Z M7.30025324,7.22041631 C7.30025325,7.34057586 7.25344807,7.455814 7.1701343,7.54077963 C7.08682054,7.62574527 6.97382282,7.67347846 6.85599937,7.67347845 L5.52323778,7.67347845 C5.40541433,7.67347845 5.29241662,7.62574526 5.20910286,7.54077962 C5.1257891,7.45581399 5.07898392,7.34057586 5.07898392,7.22041631 L5.07898392,4.50204353 C5.07898392,4.25182423 5.27788315,4.04898141 5.52323778,4.04898141 L6.85599937,4.04898141 C6.97382282,4.0489814 7.08682053,4.09671459 7.1701343,4.18168023 C7.25344806,4.26664586 7.30025324,4.38188398 7.30025324,4.50204353 L7.30025324,7.22041631 Z"/>
                                    <path d="M16.0395149,8.14285309 C14.9017188,8.14277112 13.7879946,8.46631094 12.8316119,9.07475738 L12.8316119,0.90476144 L13.2898837,0.90476144 C13.5429803,0.90476144 13.7481556,0.702223693 13.7481556,0.45238072 C13.7481556,0.202537747 13.5429803,0 13.2898837,0 L0.458271846,0 C0.205175294,0 3.09953882e-17,0.202537747 0,0.45238072 C-3.09953882e-17,0.702223693 0.205175294,0.90476144 0.458271846,0.90476144 L0.916543713,0.90476144 L0.916543713,18.5476098 C0.916543713,19.2971387 1.5320696,19.904752 2.29135927,19.904752 L11.4567963,19.904752 C12.0618973,19.9019443 12.5939963,19.5089185 12.7674538,18.9366572 C14.8955098,20.3188737 17.678376,20.2125047 19.6917884,18.6719896 C21.7052007,17.1314744 22.5036039,14.4977193 21.6783771,12.1186736 C20.8531503,9.73962799 18.586911,8.14175939 16.0395149,8.14285309 Z M8.24889335,18.9999905 L5.04099039,18.9999905 L5.04099039,13.1190411 C5.04099039,12.8691981 5.24616568,12.6666604 5.49926223,12.6666604 L7.7906215,12.6666604 C8.04371806,12.6666604 8.24889335,12.8691981 8.24889335,13.1190411 L8.24889335,18.9999905 Z M11.9150682,18.5476098 C11.9150682,18.6675886 11.8667861,18.7826535 11.7808435,18.8674913 C11.6949008,18.9523291 11.5783376,18.9999906 11.4567963,18.9999905 L9.16543706,18.9999905 L9.16543706,13.1190411 C9.16543706,12.3695121 8.54991117,11.7618989 7.7906215,11.7618989 L5.49926223,11.7618989 C4.73997257,11.7618989 4.12444667,12.3695121 4.12444667,13.1190411 L4.12444667,18.9999905 L2.29135927,18.9999905 C2.16981801,18.9999906 2.05325477,18.9523291 1.96731212,18.8674913 C1.88136947,18.7826535 1.8330874,18.6675886 1.8330874,18.5476098 L1.8330874,0.90476144 L11.9150682,0.90476144 L11.9150682,9.78499513 C10.7532544,10.8852548 10.0920215,12.4028582 10.0819808,13.9921359 L10.0819808,14.0645168 C10.0944905,15.6506472 10.7555258,17.1645345 11.9150682,18.2626099 L11.9150682,18.5476098 Z M16.0395149,18.9999905 C14.8691047,19.0005915 13.7349557,18.5991459 12.8316119,17.8645149 L12.6803822,17.7288007 C11.6170182,16.7850476 11.0097188,15.4398957 11.0097188,14.0283264 C11.0097188,12.616757 11.6170182,11.2716051 12.6803822,10.327852 L12.8316119,10.1921378 C14.5444077,8.79111766 16.9849956,8.66391617 18.8377206,9.87910422 C20.6904455,11.0942923 21.5173095,13.3645904 20.8725724,15.466142 C20.2278353,17.5676936 18.2639178,19.0036763 16.0395149,18.9999905 Z"/>
                                </g>
                            </svg>
                        </div>
                        <p>租房</p>
                    </div>
                    <div class="col-xs-4" @click="employeePageTo">
                        <div class="img" >
                            <svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32">
                                <path fill="#009688" d="M273.666667,279 C273.666667,275.375 271.444444,272.3125 268.358025,271.125 C270.333333,270.0625 271.691358,267.9375 271.691358,265.4375 C271.691358,261.875 268.851852,259 265.333333,259 C261.814815,259 258.975309,261.875 258.975309,265.4375 C258.975309,267.875 260.333333,270 262.308642,271.125 C259.222222,272.375 257,275.4375 257,279 L258.234568,279 L258.234568,278.6875 C258.234568,275.375 260.45679,272.5625 263.481481,271.75 L263.481481,277.75 L265.333333,278.375 L267.185185,277.75 L267.185185,271.75 C270.209877,272.5625 272.432099,275.375 272.432099,278.6875 L272.432099,279 L273.666667,279 Z M266.259259,277.0625 L265.333333,277.375 L264.407407,277.0625 L264.407407,271.4375 L266.259259,271.4375 L266.259259,277.0625 Z M265.333333,270.6875 C262.493827,270.6875 260.148148,268.3125 260.148148,265.4375 C260.148148,262.5625 262.432099,260.1875 265.333333,260.1875 C268.172839,260.1875 270.518519,262.5625 270.518519,265.4375 C270.45679,268.3125 268.17284,270.6875 265.333333,270.6875 Z" transform="translate(-249 -253)"/>
                            </svg>
                        </div>
                        <p>经纪人</p>
                    </div>
                </div>
                <div class="part3" v-cloak>
                    <div class="title">
                        <span class="h3">热门房源</span> <span>（售房）</span>
                        <span class="viewAll">查看全部（{{ sellNum }}） ></span>
                    </div>
                    <div class="row">
                        <div class="col-lg-3 col-md-3 col-sm-3 col-xs-6" v-for="item, index in sellQualityProperties"  :key="index">
                            <div class="img">
                                <img :src="(item.photourl == '' || item.photourl == null) ? './source/image/wx/room-1.jpg' : item.photourl" :alt="item.webtitle" />
                                <span class="price">{{ item.price + item.unitname }}</span>
                            </div>
                            <h3>{{ item.webtitle ? item.webtitle : '精品房源' }}</h3>
                            <div class="des">
                                <span>{{ item.propertydecoration }}</span>&nbsp;
                                <span>{{(item.countf == '' ? 0 : item.countf) + '室' + (item.countt == '' ? 0 : item.countt) + '厅' + (item.countw == '' ? 0 : item.countw) + '卫' + (item.county == '' ? 0 : item.county) + '阳台'}}</span>&nbsp;
                                <span>{{ item.floor + '/' + item.floorall + '层'}} </span>&nbsp;
                                <span>{{ item.square + '平米' }}</span>
                            </div>
                        </div>
                    </div>
                    <div class="title">
                        <span class="h3">热门房源</span> <span>（租房）</span>
                        <span class="viewAll">查看全部（{{ rentNum }}） ></span>
                    </div>
                    <div class="row">
                        <div class="col-lg-3 col-md-3 col-sm-3 col-xs-6" v-for="item, index in rentQualityProperties"  :key="index">
                            <div class="img">
                                <img :src="(item.photourl == '' || item.photourl == null) ? './source/image/wx/room-1.jpg' : item.photourl" :alt="item.webtitle" />
                                <span class="price">{{ item.rentprice + item.rentunitname }}</span>
                            </div>
                            <h3>{{ item.webtitle ? item.webtitle : '精品房源' }}</h3>
                            <div class="des">
                                <span>{{ item.propertydecoration }}</span>&nbsp;
                                <span>{{(item.countf == '' ? 0 : item.countf) + '室' + (item.countt == '' ? 0 : item.countt) + '厅' + (item.countw == '' ? 0 : item.countw) + '卫' + (item.county == '' ? 0 : item.county) + '阳台'}}</span>&nbsp;
                                <span>{{ item.floor + '/' + item.floorall + '层'}} </span>&nbsp;
                                <span>{{ item.square + '平米' }}</span>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>

        <section class="bannerBox">
            <div class="swiper-container">
                <div class="swiper-wrapper">
                    <div class="swiper-slide">
                        <div class="row img">
                            <img src="./source/image/wx/banner1.jpg" alt="">
                            <h2>麓湖*A4美术馆新馆开馆展 <br/>成都最先锋创造空间</h2>
                            <div class="btn">了解更多</div>
                        </div>
                    </div>
                    <div class="swiper-slide">
                        <div class="row img">
                            <img src="./source/image/wx/banner1.jpg" alt="">
                            <h2>麓湖*A4美术馆新馆开馆展 <br/>成都最先锋创造空间</h2>
                            <div class="btn">了解更多</div>
                        </div>
                    </div>
                    <div class="swiper-slide">
                        <div class="row img">
                            <img src="./source/image/wx/banner1.jpg" alt="">
                            <h2>麓湖*A4美术馆新馆开馆展 <br/>成都最先锋创造空间</h2>
                            <div class="btn">了解更多</div>
                        </div>
                    </div>
                </div>
                <!-- 如果需要分页器 -->
                <div class="swiper-pagination"></div>

                <!-- 如果需要导航按钮 -->
                <!--<div class="swiper-button-prev"></div>-->
                <!--<div class="swiper-button-next"></div>-->

            </div>
        </section>

        <section class="hot">
            <div class="container">
                <div class="row">
                    <div class="title">
                        <span class="h3">热门小区</span> <span></span>
                        <span class="viewAll">查看全部（2000+） ></span>
                    </div>
                </div>
                <div class="row">
                    <div class="col-lg-3 col-md-3 col-sm-3 col-xs-6">
                        <div class="img">
                            <img src="./source/image/wx/room-4.jpg" alt="">
                        </div>
                        <h3>南湖国际社区</h3>
                        <div class="col-xs-0">
                            <h4>14200／平</h4>
                        </div>
                        <div class="des">
                            <span>林溪美城</span>&nbsp;
                            <span>3室2厅</span>&nbsp;
                            <span>67.31平米</span>&nbsp;
                            <span>精装</span>
                        </div>
                    </div>
                    <div class="col-lg-3 col-md-3 col-sm-3 col-xs-6">
                        <div class="img">
                            <img src="./source/image/wx/room-4.jpg" alt="">
                        </div>
                        <h3>南湖国际社区</h3>
                        <div class="col-xs-0">
                            <h4>14200／平</h4>
                        </div>
                        <div class="des">
                            <span>林溪美城</span>&nbsp;
                            <span>3室2厅</span>&nbsp;
                            <span>67.31平米</span>&nbsp;
                            <span>精装</span>
                        </div>
                    </div>
                    <div class="col-lg-3 col-md-3 col-sm-3 col-xs-6">
                        <div class="img">
                            <img src="./source/image/wx/room-4.jpg" alt="">
                        </div>
                        <h3>南湖国际社区</h3>
                        <div class="col-xs-0">
                            <h4>14200／平</h4>
                        </div>
                        <div class="des">
                            <span>林溪美城</span>&nbsp;
                            <span>3室2厅</span>&nbsp;
                            <span>67.31平米</span>&nbsp;
                            <span>精装</span>
                        </div>
                    </div>
                    <div class="col-lg-3 col-md-3 col-sm-3 col-xs-6">
                        <div class="img">
                            <img src="./source/image/wx/room-4.jpg" alt="">
                        </div>
                        <h3>南湖国际社区</h3>
                        <div class="col-xs-0">
                            <h4>14200／平</h4>
                        </div>
                        <div class="des">
                            <span>林溪美城</span>&nbsp;
                            <span>3室2厅</span>&nbsp;
                            <span>67.31平米</span>&nbsp;
                            <span>精装</span>
                        </div>
                    </div>
                </div>
            </div>
        </section>

        <section class="dataBox">
            <div class="container">
                <h1>房价大数据</h1>
                <div class="row">
                    <div class="col-lg-9 col-md-9 col-sm-9">
                        <div id="chart"></div>
                    </div>
                    <div class="col-lg-3  col-md-3 col-sm-3">
                        <div class="average">
                            <h3>6750</h3>
                            <h4>本月成交价 元／平</h4>
                        </div>
                        <div class="percent">
                            <h3>0.75</h3>
                            <h4>环比上月</h4>
                        </div>
                    </div>
                </div>
            </div>
        </section>

        <footer>
            <div class="container">
                <div class="row">
                    <ul>
                        <span>
                            <li><a href="＃">网站首页</a></li>
                            <li><a href="＃">联系我们</a></li>
                            <li><a href="＃">关于我们</a></li>
                            <li><a href="＃">加入我们</a></li>
                            <li><a href="＃">帮助中心</a></li>
                            <li><a href="＃">相关下载</a></li>
                            <li><a href="＃">房产联盟</a></li>
                        </span>
                    </ul>
                </div>
            </div>
        </footer>
    </div>

    <script src="./lib/jquery/jquery-3.3.1.min.js"></script>
    <script src="./lib/bootstrap/js/bootstrap.min.js"></script>
    <script src="./lib/swiper/swiper-3.4.2.min.js"></script>
    <script src="./lib/echarts/echarts.common.min.js"></script>
    <script src="./lib/vue/vue.min.js"></script>
    <script src="./lib/axios/axios.min.js"></script>
    <script src="./js/share.js"></script>
    <script src="./js/wx_home.js"></script>
</body>
</html>